**Terraform Plan Output:**
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ansible.data.template_file.ansible_inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "ansible_inventory" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [web]
            ${join("\n", [for ip in split(",", private_ips) : "${ip} ansible_user=ubuntu ansible_ssh_private_key_file=~/.ssh/ansible.pem"])}
        EOT
      + vars     = {
          + "private_ips" = (known after apply)
        }
    }

  # module.ansible.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/ansible/../../ansible/inventory.ini"
      + id                   = (known after apply)
    }

  # module.ansible.null_resource.copy_ansible will be created
  + resource "null_resource" "copy_ansible" {
      + id = (known after apply)
    }

  # module.ansible.null_resource.copy_deps will be created
  + resource "null_resource" "copy_deps" {
      + id = (known after apply)
    }

  # module.compute.aws_instance.ansible_controller will be created
  + resource "aws_instance" "ansible_controller" {
      + ami                                  = "ami-07a63969ac0961461"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "ansible-controller"
        }
      + tags_all                             = {
          + "Name" = "ansible-controller"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "074723080873a9c61c059b137c350343d51d3433"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.compute.aws_instance.app_instance[0] will be created
  + resource "aws_instance" "app_instance" {
      + ami                                  = "ami-07a63969ac0961461"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "865fa144d07d5fd0d9e82cbe863cd0e5c25c1d48"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.compute.null_resource.copy_ssh_key will be created
  + resource "null_resource" "copy_ssh_key" {
      + id = (known after apply)
    }

  # module.network.aws_internet_gateway.internet_gateway will be created
  + resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "env" = "dev"
        }
      + tags_all = {
          + "env" = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "env" = "dev"
        }
      + tags_all         = {
          + "env" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.public_route_table_association["0"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_route_table_association["1"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_route_table_association["2"] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.ansible_sg will be created
  + resource "aws_security_group" "ansible_sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ansible_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env" = "dev"
        }
      + tags_all               = {
          + "env" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_security_group.app_sg will be created
  + resource "aws_security_group" "app_sg" {
      + arn                    = (known after apply)
      + description            = "Allow TLS traffic inbound and all outbound"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env" = "dev"
        }
      + tags_all               = {
          + "env" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_subnet.public_subnets[0] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "env" = "dev"
        }
      + tags_all                                       = {
          + "env" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnets[1] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "env" = "dev"
        }
      + tags_all                                       = {
          + "env" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnets[2] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "env" = "dev"
        }
      + tags_all                                       = {
          + "env" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env" = "dev"
        }
      + tags_all                             = {
          + "env" = "dev"
        }
    }

  # module.network.aws_vpc_security_group_egress_rule.ansible_to_app will be created
  + resource "aws_vpc_security_group_egress_rule" "ansible_to_app" {
      + arn                          = (known after apply)
      + from_port                    = 22
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 22
    }

  # module.network.aws_vpc_security_group_egress_rule.ansible_to_internet will be created
  + resource "aws_vpc_security_group_egress_rule" "ansible_to_internet" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.network.aws_vpc_security_group_egress_rule.app_allow_all_outbound will be created
  + resource "aws_vpc_security_group_egress_rule" "app_allow_all_outbound" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.network.aws_vpc_security_group_ingress_rule.allow_ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 22
    }

  # module.network.aws_vpc_security_group_ingress_rule.allow_ssh_from_ansible will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_ssh_from_ansible" {
      + arn                          = (known after apply)
      + from_port                    = 22
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 22
    }

  # module.network.aws_vpc_security_group_ingress_rule.allow_tls_ipv4["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_tls_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.network.aws_vpc_security_group_ingress_rule.allow_tls_ipv4["1"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_tls_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.route53.aws_iam_instance_profile.ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-route53-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.route53.aws_iam_policy.route53_policy will be created
  + resource "aws_iam_policy" "route53_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for EC2 to interact with Route 53"
      + id               = (known after apply)
      + name             = "route53-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z02256011JZOQQGDRVPNY",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.route53.aws_iam_role.ec2_route53_role will be created
  + resource "aws_iam_role" "ec2_route53_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-route53-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.route53.aws_iam_role_policy_attachment.route53_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "route53_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ec2-route53-role"
    }

  # module.route53.aws_route53_record.A_record will be created
  + resource "aws_route53_record" "A_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dwaynechima.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z02256011JZOQQGDRVPNY"
    }

  # module.route53.aws_route53_record.wildcard_record will be created
  + resource "aws_route53_record" "wildcard_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.dwaynechima.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z02256011JZOQQGDRVPNY"
    }

  # module.sshkey.aws_key_pair.key_pair will be created
  + resource "aws_key_pair" "key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "docker"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.sshkey.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/sshkey/../../dev/docker.pem"
      + id                   = (known after apply)
    }

  # module.sshkey.tls_private_key.ssh_key will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.templates.local_file.backend_var will be created
  + resource "local_file" "backend_var" {
      + content              = <<-EOT
            # Domain
            # This would be set to the production domain with an env var on deployment
            DOMAIN=localhost
            
            # Environment: local, staging, production
            ENVIRONMENT=local
            
            PROJECT_NAME="Full Stack FastAPI Project"
            STACK_NAME=full-stack-fastapi-project
            
            # Backend
            BACKEND_CORS_ORIGINS="http://dwaynechima.site,https://dwaynechima.site"
            SECRET_KEY=changethis123
            FIRST_SUPERUSER=chanllenge@devopsdojo.com
            FIRST_SUPERUSER_PASSWORD=devopsdojo57
            USERS_OPEN_REGISTRATION=True
            
            # Emails
            SMTP_HOST=
            SMTP_USER=
            SMTP_PASSWORD=
            EMAILS_FROM_EMAIL=info@example.com
            SMTP_TLS=True
            SMTP_SSL=False
            SMTP_PORT=587
            
            # Postgres
            POSTGRES_SERVER=database
            POSTGRES_PORT=5432
            POSTGRES_DB=app
            POSTGRES_USER=app
            POSTGRES_PASSWORD=changethis123
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/env/.backend-env"
      + id                   = (known after apply)
    }

  # module.templates.local_file.docker_compose will be created
  + resource "local_file" "docker_compose" {
      + content              = <<-EOT
            services:
            
            # Application Stack
            
              frontend:
                image: darkkami/frontend-template
                ports:
                  - '5173:5173'
                env_file:
                  - ./dependencies/env/.frontend-env
                logging:
                  driver: json-file
                  options:
                    tag: "{{.Name}}"
                networks:
                  - app-network
            
              backend:
                image: darkkami/backend-template
                ports:
                  - '8000:8000'
                env_file:
                  - ./dependencies/env/.backend-env
                logging:
                  driver: json-file
                  options:
                    tag: "{{.Name}}"
                networks:
                  - app-network
                depends_on:
                  - database
            
              database:
                image: postgres
                restart: always
                ports:
                  - '5432:5432'
                env_file:
                  - ./dependencies/env/.backend-env
                logging:
                  driver: json-file
                  options:
                    tag: "{{.Name}}"
                volumes:
                  - db-vol:/var/lib/postgresql/data
                networks:
                  - app-network
            
              adminer:
                image: adminer:latest
                container_name: adminer
                environment:
                  ADMINER_DEFAULT_SERVER: database
                restart: always
                ports:
                  - '8080:8080'
                networks:
                  - app-network
            
              proxy:
                image: jc21/nginx-proxy-manager
                container_name: proxy
                restart: unless-stopped
                ports:
                  - '80:80'
                  - '81:81'
                  - '443:443'
                volumes:
                  - ./dependencies/nginx/nginx.conf:/data/nginx/custom/http_top.conf 
                  - /etc/letsencrypt/:/etc/letsencrypt  
                depends_on:
                  - frontend 
                  - backend   
                networks:
                  - app-network
            
            
            # ...................................Monitoring Stack .........................................................
            
            
            # Prometheus stack
              prometheus:
                image: prom/prometheus
                container_name: prometheus
                ports:
                  - "9090:9090"
                volumes:
                  - ./dependencies/scripts/prometheus.yaml:/etc/prometheus/prometheus.yml
                restart: always
                networks:
                  - app-network
            
              node-exporter:
                image: prom/node-exporter
                container_name: node-exporter
                ports:
                  - "9100:9100"
                restart: always
                networks:
                  - app-network
            
              blackbox_exporter:
                image: prom/blackbox-exporter
                container_name: blackbox_exporter
                ports:
                  - "9115:9115"
                volumes:
                  - ./dependencies/scripts/blackbox.yml:/etc/blackbox_exporter/blackbox.yml
                restart: always
                networks:
                  - app-network
            
            # Grafana stack
              grafana:
                image: grafana/grafana
                container_name: grafana
                environment:
                  - GF_SECURITY_ADMIN_USER=admin
                  - GF_SECURITY_ADMIN_PASSWORD=admin
                ports:
                  - "3000:3000"
                volumes:
                  - grafana_data:/var/lib/grafana
                  - ./dependencies/grafana/grafana.ini:/etc/grafana/grafana.ini
                  - ./dependencies/grafana/default.yaml:/etc/grafana/provisioning/dashboards/default.yaml
                  - ./dependencies/grafana/datasource.yaml:/etc/grafana/provisioning/datasources/datasources.yaml
                  - ./dependencies/grafana/dashboards:/var/lib/grafana/dashboards
                  - /etc/letsencrypt/live/dwaynechima.site/cert.pem:/etc/grafana/cert.perm
                  - /etc/letsencrypt/live/dwaynechima.site/privkey.pem:/etc/grafana/privkey.pem 
                restart: always
                depends_on:
                  - prometheus
                networks:
                  - app-network
            
              loki:
                image: grafana/loki
                container_name: loki
                volumes:
                  - ./dependencies/scripts/loki-config.yaml:/etc/loki/config.yaml
                command: -config.file=/etc/loki/local-config.yaml
                ports:
                  - "3100:3100"
                restart: always
                networks:
                  - app-network
            
            
              promtail:
                image: grafana/promtail
                container_name: promtail
                volumes:
                  - /var/log:/var/log
                  - /var/lib/docker/containers:/var/lib/docker/containers
                  - ./dependencies/scripts/promtail-config.yaml:/etc/promtail/config.yaml
                command: -config.file=/etc/promtail/config.yaml
                depends_on:
                  - loki
                restart: always
                networks:
                  - app-network
            
            
              cadvisor:
                image: gcr.io/cadvisor/cadvisor:latest
                container_name: cadvisor
                ports:
                  - "8081:8080"
                volumes:
                  - /:/rootfs:ro
                  - /var/run:/var/run:rw
                  - /sys:/sys:ro
                  - /var/lib/docker/:/var/lib/docker:ro
                restart: always
                networks:
                  - app-network
            
            networks:
              app-network:
                driver: bridge
            
            volumes:
              grafana_data:
              db-vol:
                driver: local
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/docker-compose.yaml"
      + id                   = (known after apply)
    }

  # module.templates.local_file.frontend_var will be created
  + resource "local_file" "frontend_var" {
      + content              = "VITE_API_URL=https://dwaynechima.site"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/env/.frontend-env"
      + id                   = (known after apply)
    }

  # module.templates.local_file.grafana_ini will be created
  + resource "local_file" "grafana_ini" {
      + content              = <<-EOT
            [server]
            protocol = http
            http_port = 3000
            
            serve_from_sub_path = true
            
            domain = dwaynechima.site
            enforce_domain = true
            root_url = https://dwaynechima.site/grafana/
            cert_file = /etc/grafana/cert.pem
            cert_key = /etc/grafana/privkey.pem
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/grafana/grafana.ini"
      + id                   = (known after apply)
    }

  # module.templates.local_file.nginx_config will be created
  + resource "local_file" "nginx_config" {
      + content              = <<-EOT
            # Redirect HTTP to HTTPS for the main domain
            server {
                listen 80;
                server_name dwaynechima.site www.dwaynechima.site;
                return 301 https://$host$request_uri;
            }
            
            # Redirect www to non-www for the main domain
            server {
                listen 443 ssl;
                server_name www.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                return 301 https://dwaynechima.site$request_uri;
            }
            
            # Main domain (HTTPS)
            server {
                listen 443 ssl;
                server_name dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://frontend:5173; 
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
            
                location /grafana/ {
                    proxy_pass http://grafana:3000;
                    proxy_set_header Host $host;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /api {
                    proxy_pass http://backend:8000/api;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /docs {
                    proxy_pass http://backend:8000/docs;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            
                location /redoc {
                    proxy_pass http://backend:8000/redoc;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Redirect HTTP to HTTPS for subdomains
            server {
                listen 80;
                server_name proxy.dwaynechima.site db.dwaynechima.site prometheus.dwaynechima.site;
                return 301 https://$host$request_uri;
            }
            
            # Database subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name db.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://adminer:8080; 
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Proxy subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name proxy.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://proxy:81;  
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
            
            # Prometheus subdomain (HTTPS)
            server {
                listen 443 ssl;
                server_name prometheus.dwaynechima.site;
            
                ssl_certificate /etc/letsencrypt/live/dwaynechima.site/fullchain.pem;
                ssl_certificate_key /etc/letsencrypt/live/dwaynechima.site/privkey.pem;
            
                location / {
                    proxy_pass http://prometheus:9090;
                    proxy_set_header Host $host;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../modules/template/../../dependencies/nginx/nginx.conf"
      + id                   = (known after apply)
    }

  # module.trigger_playbook.null_resource.ansible_play will be created
  + resource "null_resource" "ansible_play" {
      + id = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ansible_ip               = (known after apply)
  + app_instance_ip          = [
      + (known after apply),
    ]
  + app_instance_private_ips = [
      + (known after apply),
    ]

```